Reading and writing text files

In [1]:
import numpy as np

import pandas as pd

from pandas import Series, DataFrame

In [2]:
import os

In [3]:
# had to get my cwd- current working directory

In [4]:
curr = os.getcwd()
curr

'C:\\Users\\HP'

In [5]:
dframe = pd.read_csv('omo_.csv')
dframe

    Name   class    DOB  Level
0   dabby    ss2  march    200
1    rose    ss3  april    300
2  prince    ss1    feb    400
3    josh   jss3   sept    300
4   human  sceva    may    200

In [6]:
# suppose i do not want the header to be there

In [7]:
dframe = pd.read_csv('omo_.csv', header = None )
dframe

        0       1      2      3
0   Name    class    DOB  Level
1   dabby     ss2  march    200
2    rose     ss3  april    300
3  prince     ss1    feb    400
4    josh    jss3   sept    300
5   human   sceva    may    200

In [8]:
# a different way of fetching a file from your external directory

In [9]:
dframe = pd.read_csv('omo_.csv',sep=',', header = None )
dframe

        0       1      2      3
0   Name    class    DOB  Level
1   dabby     ss2  march    200
2    rose     ss3  april    300
3  prince     ss1    feb    400
4    josh    jss3   sept    300
5   human   sceva    may    200

In [10]:
# to read n- number of rows from a table

In [11]:
pd.read_csv('omo_.csv',nrows= 3 )

    Name   class    DOB  Level
0   dabby    ss2  march    200
1    rose    ss3  april    300
2  prince    ss1    feb    400

In [12]:
dframe

        0       1      2      3
0   Name    class    DOB  Level
1   dabby     ss2  march    200
2    rose     ss3  april    300
3  prince     ss1    feb    400
4    josh    jss3   sept    300
5   human   sceva    may    200

In [13]:
# exporting files

In [14]:
dframe.to_csv('phew.csv')

In [15]:
 import sys

In [16]:
dframe.to_csv(sys.stdout)

,0,1,2,3
0,Name , class, DOB,Level
1,dabby, ss2,march,200
2,rose,ss3,april,300
3,prince,ss1,feb,400
4,josh,jss3,sept,300
5,human,sceva,may,200

In [17]:
dframe.to_csv(sys.stdout, sep= '/')

/0/1/2/3
0/Name / class/ DOB/Level
1/dabby/ ss2/march/200
2/rose/ss3/april/300
3/prince/ss1/feb/400
4/josh/jss3/sept/300
5/human/sceva/may/200

In [18]:
url = 'https://docs.python.org/2/library/csv.html'
url

'https://docs.python.org/2/library/csv.html'

In [19]:
# JSON with python
# JSON = javascript object notation

In [20]:
json_obj = """
{    "zoo_animal": "Lion",
    "food": ["meat","vegies","honey"],
    "fur": "Golden",
    "clothes": "null",
    "Diet":[{"zoo_animal": "Gazelle","food":"grass","fur": "brown"}]
}    
"""

In [21]:
import json

In [22]:
# to load the json data

In [23]:
ser =json.loads(json_obj)
ser

{'zoo_animal': 'Lion',
 'food': ['meat', 'vegies', 'honey'],
 'fur': 'Golden',
 'clothes': 'null',
 'Diet': [{'zoo_animal': 'Gazelle', 'food': 'grass', 'fur': 'brown'}]}

In [24]:
json.dumps(ser)

'{"zoo_animal": "Lion", "food": ["meat", "vegies", "honey"], "fur": "Golden", "clothes": "null", "Diet": [{"zoo_animal": "Gazelle", "food": "grass", "fur": "brown"}]}'

In [25]:
dframe = DataFrame(ser['Diet'])
dframe

  zoo_animal   food    fur
0    Gazelle  grass  brown

html with python

In [26]:
from pandas import read_html

In [27]:
# before performing the below operation , i'd need install the 'beautiful-soup lib ' and html5lib using 

# pip install beautiful-soup
# pip install html5lib

In [28]:
url = 'https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/'

In [36]:
dframe_list = pd.io.html.read_html(url)
dframe_list

[                             Bank NameBank       CityCity StateSt  CertCert  \
 0    Republic First Bank dba Republic Bank   Philadelphia      PA     27332
 1                            Citizens Bank       Sac City      IA      8758
 2                 Heartland Tri-State Bank        Elkhart      KS     25851
 3                      First Republic Bank  San Francisco      CA     59017
 4                           Signature Bank       New York      NY     57053
 ..                                     ...            ...     ...       ...
 564                     Superior Bank, FSB       Hinsdale      IL     32646
 565                    Malta National Bank          Malta      OH      6629
 566        First Alliance Bank & Trust Co.     Manchester      NH     34264
 567      National State Bank of Metropolis     Metropolis      IL      3815
 568                       Bank of Honolulu       Honolulu      HI     21029

                  Acquiring InstitutionAI Closing DateClosing  FundFund
 0      Fulton Bank, National Association      April 26, 2024     10546
 1              Iowa Trust & Savings Bank    November 3, 2023     10545
 2                 Dream First Bank, N.A.       July 28, 2023     10544
 3              JPMorgan Chase Bank, N.A.         May 1, 2023     10543
 4                    Flagstar Bank, N.A.      March 12, 2023     10540
 ..                                   ...                 ...       ...
 564                Superior Federal, FSB       July 27, 2001      6004
 565                    North Valley Bank         May 3, 2001      4648
 566  Southern New Hampshire Bank & Trust    February 2, 2001      4647
 567              Banterra Bank of Marion   December 14, 2000      4646
 568                   Bank of the Orient    October 13, 2000      4645

 [569 rows x 7 columns]]

In [33]:
dframe = dframe_list[0]
dframe

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Republic First Bank dba Republic Bank,Philadelphia,PA,27332,"Fulton Bank, National Association","April 26, 2024",10546
1,Citizens Bank,Sac City,IA,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
2,Heartland Tri-State Bank,Elkhart,KS,25851,"Dream First Bank, N.A.","July 28, 2023",10544
3,First Republic Bank,San Francisco,CA,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
4,Signature Bank,New York,NY,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
...,...,...,...,...,...,...,...
564,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001",6004
565,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001",4648
566,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001",4647
567,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000",4646
568,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000",4645

In [34]:
dframe.columns.values

array(['Bank NameBank', 'CityCity', 'StateSt', 'CertCert',
       'Acquiring InstitutionAI', 'Closing DateClosing', 'FundFund'],
      dtype=object)